#include "UtilFunctionTesters/RLCDataflow/UnwrapValuePointerToStructTester.h"

UnwrapValuePointerToStructTester::UnwrapValuePointerToStructTester() {}

bool UnwrapValuePointerToStructTester::runTest() {
    llvm::LLVMContext context;
    
    // based on a version of the IR for test/long_struct/index.c
    std::string irCode = R"(
        ; ModuleID = '../test/long_struct/index.c'
        source_filename = "../test/long_struct/index.c"
        target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
        target triple = "x86_64-pc-linux-gnu"

        %struct.my_struct = type { i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8* }

        @.str = private unnamed_addr constant [41 x i8] c"Calls target = _.FIELD(a) methods = free\00", section "llvm.metadata"
        @.str.1 = private unnamed_addr constant [28 x i8] c"../test/long_struct/index.c\00", section "llvm.metadata"
        @.str.2 = private unnamed_addr constant [35 x i8] c"MustCall target = _ methods = free\00", section "llvm.metadata"
        @.str.3 = private unnamed_addr constant [41 x i8] c"Calls target = _.FIELD(b) methods = free\00", section "llvm.metadata"
        @.str.4 = private unnamed_addr constant [41 x i8] c"Calls target = _.FIELD(c) methods = free\00", section "llvm.metadata"
        @.str.5 = private unnamed_addr constant [41 x i8] c"Calls target = _.FIELD(d) methods = free\00", section "llvm.metadata"

        call void @llvm.dbg.declare(metadata %struct.my_struct* %B, metadata !83, metadata !DIExpression()), !dbg !84
        %call1 = call noalias i8* @malloc(i64 15) #2, !dbg !85
        %b = getelementptr inbounds %struct.my_struct, %struct.my_struct* %B, i32 0, i32 1, !dbg !86
        %3 = bitcast i8** %b to i8*, !dbg !86
        %4 = call i8* @llvm.ptr.annotation.p0i8(i8* %3, i8* getelementptr inbounds ([35 x i8], [35 x i8]* @.str.2, i32 0, i32 0), i8* getelementptr inbounds ([28 x i8], [28 x i8]* @.str.1, i32 0, i32 0), i32 8), !dbg !86
        %5 = bitcast i8* %4 to i8**, !dbg !86
        store i8* %call1, i8** %5, align 8, !dbg !87
        call void @llvm.dbg.declare(metadata %struct.my_struct* %B1, metadata !88, metadata !DIExpression()), !dbg !89
        call void @does_something_b(%struct.my_struct* sret %B1, %struct.my_struct* byval align 8 %B), !dbg !90
        call void @llvm.dbg.declare(metadata %struct.my_struct* %C, metadata !91, metadata !DIExpression()), !dbg !92
        %call2 = call noalias i8* @malloc(i64 15) #2, !dbg !93
        %c = getelementptr inbounds %struct.my_struct, %struct.my_struct* %C, i32 0, i32 2, !dbg !94
        %6 = bitcast i8** %c to i8*, !dbg !94
        %7 = call i8* @llvm.ptr.annotation.p0i8(i8* %6, i8* getelementptr inbounds ([35 x i8], [35 x i8]* @.str.2, i32 0, i32 0), i8* getelementptr inbounds ([28 x i8], [28 x i8]* @.str.1, i32 0, i32 0), i32 9), !dbg !94
        %8 = bitcast i8* %7 to i8**, !dbg !94
        store i8* %call2, i8** %8, align 8, !dbg !95
        call void @llvm.dbg.declare(metadata %struct.my_struct* %C1, metadata !96, metadata !DIExpression()), !dbg !97
        call void @does_something_c(%struct.my_struct* sret %C1, %struct.my_struct* byval align 8 %C), !dbg !98
        call void @llvm.dbg.declare(metadata %struct.my_struct* %D, metadata !99, metadata !DIExpression()), !dbg !100
        call void @llvm.dbg.declare(metadata %struct.my_struct* %CC, metadata !101, metadata !DIExpression()), !dbg !102
        %call3 = call noalias i8* @malloc(i64 15) #2, !dbg !103
        %d = getelementptr inbounds %struct.my_struct, %struct.my_struct* %D, i32 0, i32 3, !dbg !104
        %9 = bitcast i8** %d to i8*, !dbg !104
        %10 = call i8* @llvm.ptr.annotation.p0i8(i8* %9, i8* getelementptr inbounds ([35 x i8], [35 x i8]* @.str.2, i32 0, i32 0), i8* getelementptr inbounds ([28 x i8], [28 x i8]* @.str.1, i32 0, i32 0), i32 10), !dbg !104
        %11 = bitcast i8* %10 to i8**, !dbg !104
        store i8* %call3, i8** %11, align 8, !dbg !105
        call void @llvm.dbg.declare(metadata i8** %m, metadata !106, metadata !DIExpression()), !dbg !107
        %call4 = call noalias i8* @malloc(i64 15) #2, !dbg !108
        store i8* %call4, i8** %m, align 8, !dbg !107
        call void @llvm.dbg.declare(metadata %struct.my_struct* %D1, metadata !109, metadata !DIExpression()), !dbg !110
        %12 = load i8*, i8** %m, align 8, !dbg !111
        call void @does_something_d(%struct.my_struct* sret %D1, i32 0, %struct.my_struct* byval align 8 %CC, %struct.my_struct* byval align 8 %D, i32 2, i8* %12), !dbg !112
        ret i32 0, !dbg !113
        }

        ; Function Attrs: nounwind
        declare dso_local noalias i8* @malloc(i64) #3

        attributes #0 = { noinline nounwind uwtable "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "min-legal-vector-width"="0" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-jump-tables"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
        attributes #1 = { nounwind readnone speculatable }
        attributes #2 = { nounwind }
        attributes #3 = { nounwind "correctly-rounded-divide-sqrt-fp-math"="false" "disable-tail-calls"="false" "less-precise-fpmad"="false" "no-frame-pointer-elim"="true" "no-frame-pointer-elim-non-leaf" "no-infs-fp-math"="false" "no-nans-fp-math"="false" "no-signed-zeros-fp-math"="false" "no-trapping-math"="false" "stack-protector-buffer-size"="8" "target-cpu"="x86-64" "target-features"="+fxsr,+mmx,+sse,+sse2,+x87" "unsafe-fp-math"="false" "use-soft-float"="false" }
        attributes #4 = { argmemonly nounwind }

        !llvm.dbg.cu = !{!0}
        !llvm.module.flags = !{!6, !7, !8}
        !llvm.ident = !{!9}

        !0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 8.0.1- (branches/release_80)\", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, nameTableKind: None)
        !1 = !DIFile(filename: "../test/long_struct/index.c", directory: "/c-resource-leak-checker/build")
        !2 = !{}
        !3 = !{!4}
        !4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 64)
        !5 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
        !6 = !{i32 2, !"Dwarf Version", i32 4}
        !7 = !{i32 2, !"Debug Info Version", i32 3}
        !8 = !{i32 1, !"wchar_size", i32 4}
        !9 = !{!"clang version 8.0.1- (branches/release_80)\"}
        !10 = distinct !DISubprogram(name: "does_something_a", scope: !1, file: !1, line: 28, type: !11, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
        !11 = !DISubroutineType(types: !12)
        !12 = !{!13, !13}
        !13 = !DIDerivedType(tag: DW_TAG_typedef, name: "my_struct", file: !1, line: 25, baseType: !14)
        !14 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "my_struct", file: !1, line: 6, size: 1152, elements: !15)
        !15 = !{!16, !17, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !29, !30, !31, !32, !33}
        !16 = !DIDerivedType(tag: DW_TAG_member, name: "a", scope: !14, file: !1, line: 7, baseType: !4, size: 64)
        !17 = !DIDerivedType(tag: DW_TAG_member, name: "b", scope: !14, file: !1, line: 8, baseType: !4, size: 64, offset: 64)
        !18 = !DIDerivedType(tag: DW_TAG_member, name: "c", scope: !14, file: !1, line: 9, baseType: !4, size: 64, offset: 128)
        !19 = !DIDerivedType(tag: DW_TAG_member, name: "d", scope: !14, file: !1, line: 10, baseType: !4, size: 64, offset: 192)
        !20 = !DIDerivedType(tag: DW_TAG_member, name: "filler1", scope: !14, file: !1, line: 11, baseType: !4, size: 64, offset: 256)
        !21 = !DIDerivedType(tag: DW_TAG_member, name: "filler2", scope: !14, file: !1, line: 12, baseType: !4, size: 64, offset: 320)
        !22 = !DIDerivedType(tag: DW_TAG_member, name: "filler3", scope: !14, file: !1, line: 13, baseType: !4, size: 64, offset: 384)
        !23 = !DIDerivedType(tag: DW_TAG_member, name: "filler4", scope: !14, file: !1, line: 14, baseType: !4, size: 64, offset: 448)
        !24 = !DIDerivedType(tag: DW_TAG_member, name: "filler5", scope: !14, file: !1, line: 15, baseType: !4, size: 64, offset: 512)
        !25 = !DIDerivedType(tag: DW_TAG_member, name: "filler6", scope: !14, file: !1, line: 16, baseType: !4, size: 64, offset: 576)
        !26 = !DIDerivedType(tag: DW_TAG_member, name: "filler7", scope: !14, file: !1, line: 17, baseType: !4, size: 64, offset: 640)
        !27 = !DIDerivedType(tag: DW_TAG_member, name: "filler8", scope: !14, file: !1, line: 18, baseType: !4, size: 64, offset: 704)
        !28 = !DIDerivedType(tag: DW_TAG_member, name: "filler9", scope: !14, file: !1, line: 19, baseType: !4, size: 64, offset: 768)
        !29 = !DIDerivedType(tag: DW_TAG_member, name: "filler10", scope: !14, file: !1, line: 20, baseType: !4, size: 64, offset: 832)
        !30 = !DIDerivedType(tag: DW_TAG_member, name: "filler11", scope: !14, file: !1, line: 21, baseType: !4, size: 64, offset: 896)
        !31 = !DIDerivedType(tag: DW_TAG_member, name: "filler12", scope: !14, file: !1, line: 22, baseType: !4, size: 64, offset: 960)
        !32 = !DIDerivedType(tag: DW_TAG_member, name: "filler13", scope: !14, file: !1, line: 23, baseType: !4, size: 64, offset: 1024)
        !33 = !DIDerivedType(tag: DW_TAG_member, name: "filler14", scope: !14, file: !1, line: 24, baseType: !4, size: 64, offset: 1088)
        !34 = !DILocalVariable(name: "S", arg: 1, scope: !10, file: !1, line: 28, type: !13)
        !35 = !DILocation(line: 28, column: 57, scope: !10)
        !36 = !DILocation(line: 29, column: 12, scope: !10)
        !37 = !DILocation(line: 29, column: 5, scope: !10)
        !38 = !DILocation(line: 30, column: 12, scope: !10)
        !39 = !DILocation(line: 30, column: 5, scope: !10)
        !40 = distinct !DISubprogram(name: "does_something_b", scope: !1, file: !1, line: 33, type: !11, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
        !41 = !DILocalVariable(name: "S", arg: 1, scope: !40, file: !1, line: 33, type: !13)
        !42 = !DILocation(line: 33, column: 57, scope: !40)
        !43 = !DILocation(line: 34, column: 12, scope: !40)
        !44 = !DILocation(line: 34, column: 5, scope: !40)
        !45 = !DILocation(line: 35, column: 12, scope: !40)
        !46 = !DILocation(line: 35, column: 5, scope: !40)
        !47 = distinct !DISubprogram(name: "does_something_c", scope: !1, file: !1, line: 38, type: !11, scopeLine: 38, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
        !48 = !DILocalVariable(name: "S", arg: 1, scope: !47, file: !1, line: 38, type: !13)
        !49 = !DILocation(line: 38, column: 57, scope: !47)
        !50 = !DILocation(line: 39, column: 12, scope: !47)
        !51 = !DILocation(line: 39, column: 5, scope: !47)
        !52 = !DILocation(line: 40, column: 12, scope: !47)
        !53 = !DILocation(line: 40, column: 5, scope: !47)
        !54 = distinct !DISubprogram(name: "does_something_d", scope: !1, file: !1, line: 43, type: !55, scopeLine: 43, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
        !55 = !DISubroutineType(types: !56)
        !56 = !{!13, !57, !13, !13, !57, !4}
        !57 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
        !58 = !DILocalVariable(name: "a", arg: 1, scope: !54, file: !1, line: 43, type: !57)
        !59 = !DILocation(line: 43, column: 51, scope: !54)
        !60 = !DILocalVariable(name: "S", arg: 2, scope: !54, file: !1, line: 43, type: !13)
        !61 = !DILocation(line: 43, column: 64, scope: !54)
        !62 = !DILocalVariable(name: "S1", arg: 3, scope: !54, file: !1, line: 43, type: !13)
        !63 = !DILocation(line: 43, column: 96, scope: !54)
        !64 = !DILocalVariable(name: "c", arg: 4, scope: !54, file: !1, line: 43, type: !57)
        !65 = !DILocation(line: 43, column: 123, scope: !54)
        !66 = !DILocalVariable(name: "m", arg: 5, scope: !54, file: !1, line: 43, type: !4)
        !67 = !DILocation(line: 43, column: 132, scope: !54)
        !68 = !DILocation(line: 44, column: 12, scope: !54)
        !69 = !DILocation(line: 44, column: 5, scope: !54)
        !70 = !DILocation(line: 45, column: 12, scope: !54)
        !71 = !DILocation(line: 45, column: 5, scope: !54)
        !72 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 48, type: !73, scopeLine: 48, spFlags: DISPFlagDefinition, unit: !0, retainedNodes: !2)
        !73 = !DISubroutineType(types: !74)
        !74 = !{!57}
        !75 = !DILocalVariable(name: "A", scope: !72, file: !1, line: 49, type: !13)
        !76 = !DILocation(line: 49, column: 15, scope: !72)
        !77 = !DILocation(line: 50, column: 18, scope: !72)
        !78 = !DILocation(line: 50, column: 7, scope: !72)
        !79 = !DILocation(line: 50, column: 9, scope: !72)
        !80 = !DILocalVariable(name: "A1", scope: !72, file: !1, line: 51, type: !13)
        !81 = !DILocation(line: 51, column: 15, scope: !72)
        !82 = !DILocation(line: 51, column: 20, scope: !72)
        !83 = !DILocalVariable(name: "B", scope: !72, file: !1, line: 53, type: !13)
        !84 = !DILocation(line: 53, column: 15, scope: !72)
